1:Badges
00000429

Novice Crafter 
00000430

Apprentice Crafter
00000431

Initiate Crafter
00000432

Adept Crafter
00000433

Master Artisan
00000434

Complete the Apprentice Crafting Quest
00000435

Bookworm
00000436

Libraries
00000437

Shop Visits
00000438

<image;Pet_Sergeant> Pet Sergeant
00000439

<image;Pet_Veteran> Pet Veteran
00000440

<image;Pet_Knight> Pet Knight
00000441

<image;Pet_Captain> Pet Captain
00000442

<image;Pet_Commander> Pet Commander
00000443

<image;Pet_Warlord> Pet Warlord
00000444

Grandmaster Artisan
00000445

Spiral Geographer
00000446

Shark Catcher
00000447

Defeat 50 Sharks
00000448

Sharks
00000449

Defeat 50 Sharks
00000450

Shark Fisher
00000451

Defeat 100 Sharks
00000452

Shark Jumper
00000453

Defeat 200 Sharks
00000454

Crab Chaser
00000455

Crab Tackler
00000456

Crab Angler
00000457

Defeat 200 Crabs
00000458

Defeat 100 Crabs
00000459

Defeat 50 Crabs
00000460

Crabs
00000461

Master Angler
00000462

Astrologist
00000463

Defeat the Sun, Moon, and Stars Bosses
00000464

Celestian Explorer
00000465

Complete Lounging Lizards
00000466

Grizzleheim Explorer
00000467

Find all the Yard Birds
00000468

Briskbreeze Champion
00000469

Bear Bouncer
00000470

Defeat 50 Bears
00000471

Bears
00000472

Unbearable
00000473

Defeat 100 Bears
00000474

Defeat 200 Bears
00000475

Bird Watcher
00000476

Ravens
00000477

Defeat 50 Ravens
00000478

Bird Beguiler
00000479

Defeat 100 Ravens
00000480

Ravens
00000481

Bird is the Word
00000482

Defeat 200 Ravens
00000483

Ravens
00000484

Nordic Champion
00000485

Finish all Grizzleheim quests
00000486

Wintertusk Explorer
00000487

Complete Find the Troggs
00000488

Hero of Grizzleheim
00000489

Complete Grizzleheim North
00000490

Triton Underwater Hero
00000491

Defeat Triton Underwater Boss
00000492

Waterworks Warrior
00000493

Defeate Triton Underwater Boss
00000494

Master Historian
00000495

Complete All Book Quests
00000496

Bear Blaster
00000497

Defender of the People
00000498

Defeat all bosses
00000499

Plant Purifier
00000500

Defeat 50 Plants
00000501

Defeat 100 Plants
00000502

Weed Whacker
00000503

Defeat 250 Plants
00000504

Goblin Gobbler
00000505

Defeat 50 Goblins
00000506

Goblin Smasher
00000507

Defeat 100 Goblins
00000508

Napoleon Complex
00000509

Defeat 250 Goblins
00000510

Wysteria Explorer
00000511

Complete the Wallflowers
00000512

Defeat Lord Bramble
00000513

Liberator of the Helephant
00000514

A+ Student
00000515

Finish all of Wysteria
00000516

Hero of Pegasus Place
00000517

Finish Pegasus Place
00000518

Plant Liberator
00000519

Plants
00000520

Plants
00000521

Plants
00000522

Goblins
00000523

Goblins
00000524

Goblins
00000525

Lion Leaper
00000526

Defeat 50 Lions
00000527

Lions
00000528

Lion Tamer
00000529

Defeat 100 Lions
00000530

Lions
00000531

Lions
00000532

Defeat 250 Lions
00000533

Ruler of the Jungle
00000534

Elephant Tracker
00000535

Defeat 50 Elephants
00000536

Elephants
00000537

Elephant Tamer
00000538

Defeat 100 Elephants
00000539

Elephants
00000540

White Elephant
00000541

Defeat 250 Elephants
00000542

Elephants
00000543

Hero of Zafaria
00000544

Finish all of Zafaria
00000545

Zafarian Explorer
00000546

Finish The Monkeys
00000547

Test Badge
00000548

Grandmaster Gardener
00000549

Grandmaster Gardener
00000550

Grandmaster Gardener
00000551

Grandmaster Gardener
00000552

Legendary Gardener
00000553

Legendary Gardener
00000554

Weirwood Walker
00000555

Defeat 50 Deer
00000556

Deer
00000557

Savage Hunter
00000558

Defeat 100 Deer
00000559

Deer
00000560

Master of the Wild Hunt
00000561

Defeat 200 Deer
00000562

Deer
00000563

Presser of Froudlings
00000564

Defeat 50 Froudlings
00000565

Froudlings
00000566

Fiend of the Froudlings
00000567

Defeat 100 Froudlings
00000568

Froudlings
00000569

Cold Iron Warrior
00000570

Defeat 200 Froudlings
00000571

Froudlings
00000572

Squire
00000573

Armiger
00000574

Knight Errant
00000575

Knight of the Wyrd
00000576

Knight of the Silver Rose
00000577

Avalon Explorer
00000578

Finish Crowology
00000579

Hero of Avalon
00000580

Finish all of Avalon
00000581

\\^o^/
00000582

Master of Karate and Friendship
00000583

Fighter of the Night man
00000791

Beast Master
00000936

Ninja Master
00000963

Aztecosaur Hunter
00000964

Defeat 50 Parasaurs
00000965

Parasaurs
00000966

Paleontologist
00000967

Defeat 100 Parasaurs
00000968

Scourge of the Scales
00000969

Defeat 200 Parasaurs
00000970

Dino Hunter
00000971

Defeat 50 Raptors
00000972

Raptors
00000973

Dino Trapper
00000974

Defeat 100 Raptors
00000975

Dino Devastator
00000976

Defeat 200 Raptors
00000977

Prehistoric Pugilist
00000978

Defeat 50 Tritops
00000979

Tritops
00000980

Primeval Purger
00000981

Defeat 100 Tritops
00000982

Primordial Foe
00000983

Defeat 200 Tritops
00000984

Azteca Explorer
00000985

Finish The UFOs
00000986

Lord of the Falling Sky
00000987

Finish Comet Xibalba
00000988

Ward Against Blight
00000989

Finish Wilting Flowers
00000990

Master of the Jungle
00000991

Finish all of Azteca
00000992

Transcendent Crafter
00000993

Lady of the Falling Sky
00000998

<image;Pet_Sergeant> 1st Age Pet Sergeant
00000999

<image;Pet_Veteran> 1st Age Pet Veteran
00001000

<image;Pet_Knight> 1st Age Pet Knight
00001001

<image;Pet_Captain> 1st Age Pet Captain
00001002

<image;Pet_Commander> 1st Age Pet Commander
00001003

<image;Pet_Warlord> 1st Age Pet Warlord
00001024

Author of Virtue's Poetry 
00001025

Quiet Writer of Epitaphs
00001026

Scribe of the Howlin' Wind
00001027

Bleak Master of the Pen
00001028

Coruscating Calligrapher
00001029

Cipher of Lost Glyphs
00001030

Illuminator of the Lost Pages
00001061

Get 5000 total points in PvP Tournaments
00001062

Tournament Points
00001063

Get 25000 total points in PvP Tournaments
00001064

Get 1 PVP Tournament wins
00001065

Tournament Wins
00001066

Get 10 PVP Tournament wins
00001123

Notorious Dueler
00001124

Blooded Battler
00001125

Formidable Scrapper
00001126

Acclaimed Brawler
00001149

Warrior of Winterbane
00001150

Grendel Slayer
00001171

Honorable Bronze Archon
00001172

Supreme Gladiator
00001173

Valorous Silver Archon
00001174

Wave Tamer
00001175

Glorious Golden Archon
00001176

Bearer of the Silver Sickle
00001301

Council of Light Adherent
00001302

Elixir Vitae
00001303

Council of Light Adherent
00001304

Bee Swatter
00001319

Kill 100 Spider Mages
00001320

Mantis Tamer
00001321

Fifth Column Seer
00001322

Last Rites
00001323

Webslinger
00001324

Umbra Slayer
00001325

Bane of the Arachna
00001326

Doombreaker
00001327

General of Light
00001328

Journeyman Shadowmancer
00001329

Promethean Crafter
00001330

Royal Entomologist
00001331

Promethean Crafter
00001332

Promethean Crafter
00001341

Spiral Cup Tutor
00001365

Bass Master
00001366

Honest Angler
00001367

GONE FISHIN'
00001368

Rock Hero
00001369

Constant Gardener
00001370

Blackthorn's Favorite
00001371

Flower Power
00001372

Team Player
00001373

Team Leader
00001374

Dragonspyre Angler
00001375

Complete DS-FISH-C01-003
00001376

Fisher #-1:$TITLEGENDER$#-1:{King[m] | Queen[f]}
00001377

Teams Helped
00001414

Spell Checker
00001415

Defeat 50 Spellwrit Mobs
00001416

Spellwrit Mobs
00001417

Spell Writer
00001418

Defeat 250 Spellwrit Mobs
00001419

Bone Rattler
00001420

Defeat Ultra Dungeon Rattlebones
00001421

UltraDungeon
00001422

Bone Grinder
00001423

Defeat Ultra Dungeon Rattlebones x10
00001424

Krokopatra's Bane
00001425

Defeat Ultra Dungeon Krokopatra
00001426

Krok Queen Quasher
00001427

Defeat Ultra Dungeon Krokopatra x10
00001428

Gumshoe
00001429

Defeat Ultra Dungeon Meowiarty x10
00001430

Defeat Ultra Dungeon Meowiarty
00001431

Champion of the Sky
00001432

Defeat Ultra Dungeon Zeus
00001433

Immortal Conqueror
00001434

<image;Pet_Sergeant> 2nd Age Pet Sergeant
00001435

<image;Pet_Veteran> 2nd Age Pet Veteran
00001436

<image;Pet_Knight> 2nd Age Pet Knight
00001437

<image;Pet_Captain> 2nd Age Pet Captain
00001438

<image;Pet_Commander> 2nd Age Pet Commander
00001439

<image;Pet_Warlord> 2nd Age Pet Warlord
00001440

Super Sleuth
00001441

2nd Age Notorious Dueler
00001442

2nd Age Blooded Battler
00001443

2nd Age Formidable Scrapper
00001444

2nd Age Acclaimed Brawler
00001445

Rattlebones
00001446

Zeus
00001447

Krokopatra
00001448

Meowiarty
00001451

Complete the quest "Too Cold, Too Cold"
00001452

Polaris Explorer
00001453

Revolutionary Dancer
00001454

Complete the quest "Dance Revolution"
00001455

Hero of the Basstille
00001456

Complete the quest "Storming the Basstille"
00001457

Patriôte Paragon
00001458

Complete the quest "The Empress and the Rat"
00001459

Complete the quest "Pièce de Résistance!"
00001460

Assistant to the Master Artist
00001461

Polarian Rose Picker
00001462

Complete the quest "Plotting out Polar Roses"
00001463

Ravenwood Alumnus
00001464

Complete the quest "Pomp and Circumstance"
00001465

Defender of Land & Sky
00001466

Complete the quest "Saving the Sky Anchor"
00001467

Benevolent Savage
00001468

Complete the quest "Save the Wailers"
00001469

Reddín's Redemption
00001470

Complete the quest "...Or Get Busy Dying"
00001471

Warden of Walruskberg
00001472

Complete all Walruskberg & Harbor tasks
00001473

Arcanum Initiate
00001474

Complete the quest "Arcanum Initiation"
00001475

Wizard101 Excelsior
00001476

Reach level 101 in Wizard101
00001477

Simon's Bane
00001478

Gravulum Adept
00001479

Ixnay on the Ixcax
00001480

Reading Room Roustabout
00001481

Omen's Adversary
EarnedBadgePopup
Popup message when badge becomes wearable
Badge Earned:  #1:$BADGE_NAME$
Gardener01

Novice Gardener
Gardener02

Neophyte Gardener
Gardener03

Apprentice Gardener
Gardener04

Initiate Gardener
Gardener05

Intermediate Gardener
Gardener06

Journeyman Gardener
Gardener07

Expert Gardener
Gardener08

Adept Gardener
Gardener09

Master Gardener
Gardener10

Grandmaster Gardener
Gardener11


Gardener12


Gardener13


Gardener14


Gardener15

Legendary Gardener
Gardener16

Legendary Gardener
Gardener17

Legendary Gardener
Gardener18

Legendary Gardener
Gardener19

Legendary Gardener
Gardener20

Verdant Gardener
Legendary Artisan

Legendary Artisan
NewBadgePopup
Popup message when player finds out about a new badge
Badge Discovered: #1:$BADGE_NAME$
NoBadgeProgress
Progress information shown about unknown badge
??? ??? ???
NoBadgeTitle
Label on a badge button indicating that there will be no title displayed
No Title
